# TargetId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment..::..TargetId Property
ColumnAttachment Class See Also
---
The id of the element that is attached to the column and is described by this ColumnAttachment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId TargetId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TargetId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TargetId {
	ElementId^ get ();
}
```

# See Also
ColumnAttachment Class
Autodesk.Revit.DB Namespace